result_2414XY1719JF.txt
Seq1M-Read-Q8: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
Seq1M-Write-Q8: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
Seq1M-Read: (g=2): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq1M-Write: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4K-Q32: (g=4): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4K-Q32: (g=5): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Read-4K: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
Rand-Write-4K: (g=7): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.28
Starting 8 processes
3;fio-3.28;Seq1M-Read-Q8;0;0;1048576;85955;83;12199;341;24122;11860.781016;1266.480812;24019;96374;83211.779860;3198.686531;1.000000%=72876;5.000000%=80216;10.000000%=82313;20.000000%=82313;30.000000%=83361;40.000000%=83361;50.000000%=83361;60.000000%=83361;70.000000%=83361;80.000000%=84410;90.000000%=84410;95.000000%=84410;99.000000%=86507;99.500000%=91750;99.900000%=95944;99.950000%=95944;99.990000%=95944;0%=0;0%=0;0%=0;35851;108348;95075.748859;3325.573715;77913;90292;99.737120%;85729.041667;2346.748861;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.122971%;1.647811%;1026;0;2059;0.1%;0.2%;0.4%;99.3%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.29%;99.71%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359072;66669;3;0;210604;168492;379096;99.51%
3;fio-3.28;Seq1M-Write-Q8;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1048576;38130;37;27500;82;66708;26791.958443;3801.767423;27838;254900;187358.329886;21430.894831;1.000000%=158334;5.000000%=160432;10.000000%=162529;20.000000%=166723;30.000000%=170917;40.000000%=175112;50.000000%=181403;60.000000%=200278;70.000000%=204472;80.000000%=208666;90.000000%=212860;95.000000%=214958;99.000000%=225443;99.500000%=227540;99.900000%=246415;99.950000%=254803;99.990000%=254803;0%=0;0%=0;0%=0;58690;286565;214154.409123;23936.402188;23774;45146;99.783926%;38047.611111;4569.291487;0.560020%;0.796393%;1047;0;11;0.1%;0.2%;0.4%;99.3%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.10%;0.20%;99.61%;0.10%;0.00%;0.00%;0.00%;0.00%;sdb;359072;66669;3;0;210604;168492;379096;99.51%
3;fio-3.28;Seq1M-Read;2;0;1048576;85347;83;12286;84;500;178.194302;22.075182;11361;13534;11800.261614;243.933241;1.000000%=11468;5.000000%=11599;10.000000%=11599;20.000000%=11599;30.000000%=11599;40.000000%=11599;50.000000%=11599;60.000000%=11993;70.000000%=11993;80.000000%=11993;90.000000%=12124;95.000000%=12124;99.000000%=12255;99.500000%=12779;99.900000%=13565;99.950000%=13565;99.990000%=13565;0%=0;0%=0;0%=0;11523;13765;11980.105008;252.237921;82084;88240;100.000000%;85452.250000;1773.074197;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.325600%;1.831502%;1032;0;268;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;100.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359072;66669;3;0;210604;168492;379096;99.51%
3;fio-3.28;Seq1M-Write;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1048576;34524;33;30372;174;404;272.270977;33.577241;25192;56243;29367.766207;2195.772195;1.000000%=26083;5.000000%=26345;10.000000%=26869;20.000000%=27656;30.000000%=28180;40.000000%=28704;50.000000%=29229;60.000000%=29753;70.000000%=30015;80.000000%=30801;90.000000%=31588;95.000000%=31850;99.000000%=37486;99.500000%=39059;99.900000%=46923;99.950000%=56360;99.990000%=56360;0%=0;0%=0;0%=0;25444;56535;29641.707354;2195.003978;30781;36937;100.000000%;34558.800000;1447.834757;0.503770%;0.691449%;1041;0;13;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;99.90%;0.10%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359072;66669;3;0;210604;168492;379096;99.51%
3;fio-3.28;Rand-Read-4K-Q32;4;0;729556;12159;3039;60001;6;2041;324.186593;35.552483;592;12417;10199.344903;262.537800;1.000000%=9764;5.000000%=9895;10.000000%=9895;20.000000%=10027;30.000000%=10027;40.000000%=10158;50.000000%=10158;60.000000%=10289;70.000000%=10289;80.000000%=10420;90.000000%=10551;95.000000%=10682;99.000000%=10813;99.500000%=10944;99.900000%=11599;99.950000%=11730;99.990000%=12255;0%=0;0%=0;0%=0;929;12758;10524.227210;268.284597;11517;12392;100.000000%;12168.680672;178.192570;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.763333%;5.173333%;182399;0;42;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.01%;20.08%;79.92%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359072;66669;3;0;210604;168492;379096;99.51%
3;fio-3.28;Rand-Write-4K-Q32;5;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;131056;2184;546;60005;46;14816;1810.067933;623.317056;2156;92046;56726.346497;4498.390106;1.000000%=50069;5.000000%=50593;10.000000%=54788;20.000000%=54788;30.000000%=55312;40.000000%=55312;50.000000%=55312;60.000000%=55312;70.000000%=55836;80.000000%=60030;90.000000%=61603;95.000000%=68681;99.000000%=71827;99.500000%=72876;99.900000%=74973;99.950000%=83361;99.990000%=83361;0%=0;0%=0;0%=0;16800;93825;58538.591195;4591.213229;1784;2480;100.000000%;2184.462185;98.524177;1.451570%;4.396374%;32823;0;12;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.00%;0.01%;1.09%;98.90%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359072;66669;3;0;210604;168492;379096;99.51%
3;fio-3.28;Rand-Read-4K;6;0;697508;11624;2906;60001;5;159;14.753784;4.075016;242;2029;326.460324;35.365033;1.000000%=254;5.000000%=261;10.000000%=272;20.000000%=288;30.000000%=325;40.000000%=329;50.000000%=333;60.000000%=342;70.000000%=346;80.000000%=350;90.000000%=358;95.000000%=362;99.000000%=374;99.500000%=415;99.900000%=464;99.950000%=522;99.990000%=987;0%=0;0%=0;0%=0;251;2046;341.601907;36.195512;11176;11911;100.000000%;11636.462185;166.460704;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.946667%;6.021667%;174419;0;11;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;99.92%;0.03%;0.02%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359072;66669;3;0;210604;168492;379096;99.51%
3;fio-3.28;Rand-Write-4K;7;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;127708;2128;532;60002;10;214;57.866379;3.905162;1446;15951;1808.435147;617.434293;1.000000%=1581;5.000000%=1646;10.000000%=1679;20.000000%=1712;30.000000%=1744;40.000000%=1761;50.000000%=1761;60.000000%=1777;70.000000%=1794;80.000000%=1826;90.000000%=1925;95.000000%=1974;99.000000%=2056;99.500000%=2244;99.900000%=14090;99.950000%=14090;99.990000%=15269;0%=0;0%=0;0%=0;1481;16010;1867.430379;617.413944;1884;2312;100.000000%;2130.983193;76.654959;1.706638%;4.228263%;31975;0;11;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;97.74%;2.01%;0.00%;0.25%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359072;66669;3;0;210604;168492;379096;99.51%

Seq1M-Read-Q8: (groupid=0, jobs=1): err= 0: pid=8536: Wed Jul 31 19:03:31 2024
  read: IOPS=83, BW=83.9MiB/s (88.0MB/s)(1024MiB/12199msec)
    slat (usec): min=341, max=24122, avg=11860.78, stdev=1266.48
    clat (usec): min=24019, max=96374, avg=83211.78, stdev=3198.69
     lat (msec): min=35, max=108, avg=95.08, stdev= 3.33
    clat percentiles (usec):
     |  1.00th=[72877],  5.00th=[80217], 10.00th=[82314], 20.00th=[82314],
     | 30.00th=[83362], 40.00th=[83362], 50.00th=[83362], 60.00th=[83362],
     | 70.00th=[83362], 80.00th=[84411], 90.00th=[84411], 95.00th=[84411],
     | 99.00th=[86508], 99.50th=[91751], 99.90th=[95945], 99.95th=[95945],
     | 99.99th=[95945]
   bw (  KiB/s): min=77913, max=90292, per=99.74%, avg=85729.04, stdev=2346.75, samples=24
   iops        : min=   76, max=   88, avg=83.58, stdev= 2.28, samples=24
  lat (msec)   : 50=0.29%, 100=99.71%
  cpu          : usr=0.12%, sys=1.65%, ctx=1026, majf=0, minf=2059
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
Seq1M-Write-Q8: (groupid=1, jobs=1): err= 0: pid=8540: Wed Jul 31 19:03:31 2024
  write: IOPS=37, BW=37.2MiB/s (39.0MB/s)(1024MiB/27500msec); 0 zone resets
    slat (usec): min=82, max=66708, avg=26791.96, stdev=3801.77
    clat (msec): min=27, max=254, avg=187.36, stdev=21.43
     lat (msec): min=58, max=286, avg=214.15, stdev=23.94
    clat percentiles (msec):
     |  1.00th=[  159],  5.00th=[  161], 10.00th=[  163], 20.00th=[  167],
     | 30.00th=[  171], 40.00th=[  176], 50.00th=[  182], 60.00th=[  201],
     | 70.00th=[  205], 80.00th=[  209], 90.00th=[  213], 95.00th=[  215],
     | 99.00th=[  226], 99.50th=[  228], 99.90th=[  247], 99.95th=[  255],
     | 99.99th=[  255]
   bw (  KiB/s): min=23774, max=45146, per=99.78%, avg=38047.61, stdev=4569.29, samples=54
   iops        : min=   23, max=   44, avg=37.09, stdev= 4.46, samples=54
  lat (msec)   : 50=0.10%, 100=0.20%, 250=99.61%, 500=0.10%
  cpu          : usr=0.56%, sys=0.80%, ctx=1047, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
Seq1M-Read: (groupid=2, jobs=1): err= 0: pid=8544: Wed Jul 31 19:03:31 2024
  read: IOPS=83, BW=83.3MiB/s (87.4MB/s)(1024MiB/12286msec)
    slat (usec): min=84, max=500, avg=178.19, stdev=22.08
    clat (usec): min=11361, max=13534, avg=11800.26, stdev=243.93
     lat (usec): min=11523, max=13765, avg=11980.11, stdev=252.24
    clat percentiles (usec):
     |  1.00th=[11469],  5.00th=[11600], 10.00th=[11600], 20.00th=[11600],
     | 30.00th=[11600], 40.00th=[11600], 50.00th=[11600], 60.00th=[11994],
     | 70.00th=[11994], 80.00th=[11994], 90.00th=[12125], 95.00th=[12125],
     | 99.00th=[12256], 99.50th=[12780], 99.90th=[13566], 99.95th=[13566],
     | 99.99th=[13566]
   bw (  KiB/s): min=82084, max=88240, per=100.00%, avg=85452.25, stdev=1773.07, samples=24
   iops        : min=   80, max=   86, avg=83.29, stdev= 1.73, samples=24
  lat (msec)   : 20=100.00%
  cpu          : usr=0.33%, sys=1.83%, ctx=1032, majf=0, minf=268
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq1M-Write: (groupid=3, jobs=1): err= 0: pid=8545: Wed Jul 31 19:03:31 2024
  write: IOPS=33, BW=33.7MiB/s (35.4MB/s)(1024MiB/30372msec); 0 zone resets
    slat (usec): min=174, max=404, avg=272.27, stdev=33.58
    clat (usec): min=25192, max=56243, avg=29367.77, stdev=2195.77
     lat (usec): min=25444, max=56535, avg=29641.71, stdev=2195.00
    clat percentiles (usec):
     |  1.00th=[26084],  5.00th=[26346], 10.00th=[26870], 20.00th=[27657],
     | 30.00th=[28181], 40.00th=[28705], 50.00th=[29230], 60.00th=[29754],
     | 70.00th=[30016], 80.00th=[30802], 90.00th=[31589], 95.00th=[31851],
     | 99.00th=[37487], 99.50th=[39060], 99.90th=[46924], 99.95th=[56361],
     | 99.99th=[56361]
   bw (  KiB/s): min=30781, max=36937, per=100.00%, avg=34558.80, stdev=1447.83, samples=60
   iops        : min=   30, max=   36, avg=33.68, stdev= 1.40, samples=60
  lat (msec)   : 50=99.90%, 100=0.10%
  cpu          : usr=0.50%, sys=0.69%, ctx=1041, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4K-Q32: (groupid=4, jobs=1): err= 0: pid=8549: Wed Jul 31 19:03:31 2024
  read: IOPS=3039, BW=11.9MiB/s (12.5MB/s)(712MiB/60001msec)
    slat (usec): min=6, max=2041, avg=324.19, stdev=35.55
    clat (usec): min=592, max=12417, avg=10199.34, stdev=262.54
     lat (usec): min=929, max=12758, avg=10524.23, stdev=268.28
    clat percentiles (usec):
     |  1.00th=[ 9765],  5.00th=[ 9896], 10.00th=[ 9896], 20.00th=[10028],
     | 30.00th=[10028], 40.00th=[10159], 50.00th=[10159], 60.00th=[10290],
     | 70.00th=[10290], 80.00th=[10421], 90.00th=[10552], 95.00th=[10683],
     | 99.00th=[10814], 99.50th=[10945], 99.90th=[11600], 99.95th=[11731],
     | 99.99th=[12256]
   bw (  KiB/s): min=11517, max=12392, per=100.00%, avg=12168.68, stdev=178.19, samples=119
   iops        : min= 2879, max= 3098, avg=3042.14, stdev=44.60, samples=119
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=20.08%, 20=79.92%
  cpu          : usr=1.76%, sys=5.17%, ctx=182399, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=182389,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4K-Q32: (groupid=5, jobs=1): err= 0: pid=8550: Wed Jul 31 19:03:31 2024
  write: IOPS=546, BW=2184KiB/s (2237kB/s)(128MiB/60005msec); 0 zone resets
    slat (usec): min=46, max=14816, avg=1810.07, stdev=623.32
    clat (usec): min=2156, max=92046, avg=56726.35, stdev=4498.39
     lat (usec): min=16800, max=93825, avg=58538.59, stdev=4591.21
    clat percentiles (usec):
     |  1.00th=[50070],  5.00th=[50594], 10.00th=[54789], 20.00th=[54789],
     | 30.00th=[55313], 40.00th=[55313], 50.00th=[55313], 60.00th=[55313],
     | 70.00th=[55837], 80.00th=[60031], 90.00th=[61604], 95.00th=[68682],
     | 99.00th=[71828], 99.50th=[72877], 99.90th=[74974], 99.95th=[83362],
     | 99.99th=[83362]
   bw (  KiB/s): min= 1784, max= 2480, per=100.00%, avg=2184.46, stdev=98.52, samples=119
   iops        : min=  446, max=  620, avg=546.08, stdev=24.70, samples=119
  lat (msec)   : 4=0.01%, 20=0.01%, 50=1.09%, 100=98.90%
  cpu          : usr=1.45%, sys=4.40%, ctx=32823, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32764,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Read-4K: (groupid=6, jobs=1): err= 0: pid=8554: Wed Jul 31 19:03:31 2024
  read: IOPS=2906, BW=11.4MiB/s (11.9MB/s)(681MiB/60001msec)
    slat (usec): min=5, max=159, avg=14.75, stdev= 4.08
    clat (usec): min=242, max=2029, avg=326.46, stdev=35.37
     lat (usec): min=251, max=2046, avg=341.60, stdev=36.20
    clat percentiles (usec):
     |  1.00th=[  255],  5.00th=[  262], 10.00th=[  273], 20.00th=[  289],
     | 30.00th=[  326], 40.00th=[  330], 50.00th=[  334], 60.00th=[  343],
     | 70.00th=[  347], 80.00th=[  351], 90.00th=[  359], 95.00th=[  363],
     | 99.00th=[  375], 99.50th=[  416], 99.90th=[  465], 99.95th=[  523],
     | 99.99th=[  988]
   bw (  KiB/s): min=11176, max=11911, per=100.00%, avg=11636.46, stdev=166.46, samples=119
   iops        : min= 2794, max= 2977, avg=2908.74, stdev=41.54, samples=119
  lat (usec)   : 250=0.02%, 500=99.92%, 750=0.03%, 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=1.95%, sys=6.02%, ctx=174419, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=174377,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Write-4K: (groupid=7, jobs=1): err= 0: pid=8557: Wed Jul 31 19:03:31 2024
  write: IOPS=532, BW=2128KiB/s (2179kB/s)(125MiB/60002msec); 0 zone resets
    slat (usec): min=10, max=214, avg=57.87, stdev= 3.91
    clat (usec): min=1446, max=15951, avg=1808.44, stdev=617.43
     lat (usec): min=1481, max=16010, avg=1867.43, stdev=617.41
    clat percentiles (usec):
     |  1.00th=[ 1582],  5.00th=[ 1647], 10.00th=[ 1680], 20.00th=[ 1713],
     | 30.00th=[ 1745], 40.00th=[ 1762], 50.00th=[ 1762], 60.00th=[ 1778],
     | 70.00th=[ 1795], 80.00th=[ 1827], 90.00th=[ 1926], 95.00th=[ 1975],
     | 99.00th=[ 2057], 99.50th=[ 2245], 99.90th=[14091], 99.95th=[14091],
     | 99.99th=[15270]
   bw (  KiB/s): min= 1884, max= 2312, per=100.00%, avg=2130.98, stdev=76.65, samples=119
   iops        : min=  471, max=  578, avg=532.74, stdev=19.16, samples=119
  lat (msec)   : 2=97.74%, 4=2.01%, 20=0.25%
  cpu          : usr=1.71%, sys=4.23%, ctx=31975, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,31927,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=83.9MiB/s (88.0MB/s), 83.9MiB/s-83.9MiB/s (88.0MB/s-88.0MB/s), io=1024MiB (1074MB), run=12199-12199msec

Run status group 1 (all jobs):
  WRITE: bw=37.2MiB/s (39.0MB/s), 37.2MiB/s-37.2MiB/s (39.0MB/s-39.0MB/s), io=1024MiB (1074MB), run=27500-27500msec

Run status group 2 (all jobs):
   READ: bw=83.3MiB/s (87.4MB/s), 83.3MiB/s-83.3MiB/s (87.4MB/s-87.4MB/s), io=1024MiB (1074MB), run=12286-12286msec

Run status group 3 (all jobs):
  WRITE: bw=33.7MiB/s (35.4MB/s), 33.7MiB/s-33.7MiB/s (35.4MB/s-35.4MB/s), io=1024MiB (1074MB), run=30372-30372msec

Run status group 4 (all jobs):
   READ: bw=11.9MiB/s (12.5MB/s), 11.9MiB/s-11.9MiB/s (12.5MB/s-12.5MB/s), io=712MiB (747MB), run=60001-60001msec

Run status group 5 (all jobs):
  WRITE: bw=2184KiB/s (2237kB/s), 2184KiB/s-2184KiB/s (2237kB/s-2237kB/s), io=128MiB (134MB), run=60005-60005msec

Run status group 6 (all jobs):
   READ: bw=11.4MiB/s (11.9MB/s), 11.4MiB/s-11.4MiB/s (11.9MB/s-11.9MB/s), io=681MiB (714MB), run=60001-60001msec

Run status group 7 (all jobs):
  WRITE: bw=2128KiB/s (2179kB/s), 2128KiB/s-2128KiB/s (2179kB/s-2179kB/s), io=125MiB (131MB), run=60002-60002msec

Disk stats (read/write):
  sdb: ios=359072/66669, merge=3/0, ticks=210604/168492, in_queue=379096, util=99.51%